app/controllers/companies_controller.rb

  def index
    @companies = current_user.companies.includes(:invoices, :risk_eligibilities).sort_by do |company|
---
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = $1  [["user_id", 1]]
SELECT "invoices".* FROM "invoices" WHERE "invoices"."company_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["company_id", 1], ["company_id", 2], ["company_id", 3], ["company_id", 4], ["company_id", 5], ["company_id", 6], ["company_id", 7], ["company_id", 8], ["company_id", 9], ["company_id", 10]]
SELECT "risk_eligibilities".* FROM "risk_eligibilities" WHERE "risk_eligibilities"."company_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["company_id", 1], ["company_id", 2], ["company_id", 3], ["company_id", 4], ["company_id", 5], ["company_id", 6], ["company_id", 7], ["company_id", 8], ["company_id", 9], ["company_id", 10]]