app/controllers/dashboard_controller.rb

  def index
    @companies = current_user.companies.includes(:invoices, :risk_eligibilities)
    @current_month = Date.current.beginning_of_month..Date.current.end_of_month

    @portfolio_count = @companies.size
    @operating_companies = @companies.select(&:operating?)
    @operating_rate = percentage(@operating_companies.size, @portfolio_count)

    @financed_amount = portfolio_invoices.xepelin.where(financed_on: @current_month).sum(:amount)
    @sii_volume = portfolio_invoices.where(issue_date: @current_month).sum(:amount)
    @share_of_wallet = percentage(@financed_amount, @sii_volume)
    @expansion_opportunity = [@sii_volume - @financed_amount, 0].max

    @unpaid_invoices = portfolio_invoices.xepelin.unpaid.includes(:company, :debtor).order(:due_date)
    @overdue_amount = @unpaid_invoices.overdue.sum(:amount)

    @reactivation_opportunities = @companies
      .select { |company| %w[reactivation_opportunity first_operation_opportunity].include?(company.activation_state) }
      .sort_by { |company| -company.expansion_opportunity(from: Date.current.beginning_of_month, to: Date.current.end_of_month) }
      .first(10)

    @top_financed_companies = @companies
      .sort_by { |company| -company.financed_amount(from: Date.current.beginning_of_month, to: Date.current.end_of_month) }
      .first(10)
---
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "companies" WHERE "companies"."user_id" = $1  [["user_id", 1]]
SELECT "invoices".* FROM "invoices" WHERE "invoices"."company_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["company_id", 1], ["company_id", 2], ["company_id", 3], ["company_id", 4], ["company_id", 5], ["company_id", 6], ["company_id", 7], ["company_id", 8], ["company_id", 9], ["company_id", 10]]
SELECT "risk_eligibilities".* FROM "risk_eligibilities" WHERE "risk_eligibilities"."company_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["company_id", 1], ["company_id", 2], ["company_id", 3], ["company_id", 4], ["company_id", 5], ["company_id", 6], ["company_id", 7], ["company_id", 8], ["company_id", 9], ["company_id", 10]]
SELECT SUM("invoices"."amount") FROM "invoices" WHERE "invoices"."company_id" = $1  [["company_id", 8]]