app/models/user.rb

  def self.from_google(auth)
    user = find_or_initialize_by(email: auth.info.email)

    user.google_uid = auth.uid
    user.name = auth.info.name.presence || auth.info.email
    user.avatar_url = auth.info.image
    user.save!
---
UPDATE "users" SET "name" = $1, "google_uid" = $2, "avatar_url" = $3, "updated_at" = $4 WHERE "users"."id" = $5